In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])
table

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [3]:
table['Birth_year'].map(lambda x: str(x)[0:3])

a    199
b    198
c    199
d    199
e    198
Name: Birth_year, dtype: object

In [4]:
table['First three number'] = table['Birth_year'].map(lambda x: str(x)[0:3])
table

    ID      City  Birth_year     Name First three number
a  100     Tokyo        1990  Hiroshi                199
b  101     Osaka        1989    Akiki                198
c  102     Kyoto        1992     Yuki                199
d  103  Hokkaido        1997   Satoru                199
e  104     Tokyo        1982    Steve                198